RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_usbfs_dev_drv_io.c
/***************************************************************************//**
* \file cy_usbfs_dev_drv_io.c
* \version 2.20.2
*
* Provides data transfer API implementation of the USBFS driver.
*
********************************************************************************
* \copyright
* Copyright 2018-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXUSBFS) && defined (CY_IP_MXPERI)

#include <string.h>
#include "cy_usbfs_dev_drv_pvt.h"

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
*                        Internal Constants
*******************************************************************************/

/* The time to wait (in milliseconds) for completion of a BULK or INTERRUPT transfer (max packet 64 bytes).
* The transfer takes 48.5 us = (1/ 12) * (32 (IN/OUT) + (64 * 8 + 32) (DATA) + 16 (ACK) + 6 (EOPs)), used 50 us.
*/
#define WAIT_TRANSFER_COMPLETE     (50U)

/* Dedicated IN and OUT endpoints buffer: 32 bytes (2^5) */
#define ENDPOINTS_BUFFER_SIZE   (0x55UL)

/* The number of bytes transferred by 1 Y-loop */
#define DMA_YLOOP_INCREMENT     (32UL)

/* All arbiter interrupt sources */
#define ENDPOINT_ARB_INTR_SOURCES_ALL    (USBFS_USBDEV_ARB_EP_IN_BUF_FULL_Msk | \
                                          USBFS_USBDEV_ARB_EP_DMA_GNT_Msk     | \
                                          USBFS_USBDEV_ARB_EP_BUF_OVER_Msk    | \
                                          USBFS_USBDEV_ARB_EP_BUF_UNDER_Msk   | \
                                          USBFS_USBDEV_ARB_EP_ERR_Msk         | \
                                          USBFS_USBDEV_ARB_EP_DMA_TERMIN_Msk)

/* Arbiter interrupt sources for OUT and IN endpoints when mode is
* CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO.
*/
#define ENDPOINT_ARB_INTR_SOURCES_CPU       (USBFS_USBDEV_ARB_EP_ERR_Msk)

#define OUT_ENDPOINT_ARB_INTR_SOURCES_CPU   (USBFS_USBDEV_ARB_EP_ERR_Msk)

#define IN_ENDPOINT_ARB_INTR_SOURCES_DMA    (USBFS_USBDEV_ARB_EP_IN_BUF_FULL_Msk | \
                                             USBFS_USBDEV_ARB_EP_ERR_Msk)

#define OUT_ENDPOINT_ARB_INTR_SOURCES_DMA   (USBFS_USBDEV_ARB_EP_DMA_GNT_Msk | \
                                             USBFS_USBDEV_ARB_EP_ERR_Msk)


/*******************************************************************************
*                        Internal Functions Prototypes
*******************************************************************************/
static void DisableEndpoint(USBFS_Type *base, uint32_t endpoint, cy_stc_usbfs_dev_drv_context_t *context);


/*******************************************************************************
* Function Name: DisableEndpoint
****************************************************************************//**
*
* Disables the endpoint operation.
*
* \param base
* The pointer to the USBFS instance.
*
* \param endpoint
* The data endpoint number.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
*******************************************************************************/
static void DisableEndpoint(USBFS_Type *base, uint32_t endpoint, cy_stc_usbfs_dev_drv_context_t *context)
{
    /* Disables endpoint SIE mode and sets the appropriate state */
    Cy_USBFS_Dev_Drv_SetSieEpMode(base, endpoint, CY_USBFS_DEV_DRV_EP_CR_DISABLE);
    context->epPool[endpoint].state = CY_USB_DEV_EP_DISABLED;
}


/*******************************************************************************
* Function Name: Cy_USBFS_Dev_Drv_ConfigDevice
****************************************************************************//**
*
* Sets the basic device configuration (clears previous configuration).
* Call this function after the endpoints were configured to complete the
* device configuration.
*
* \param base
* The pointer to the USBFS instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
*******************************************************************************/
void Cy_USBFS_Dev_Drv_ConfigDevice(USBFS_Type *base, cy_stc_usbfs_dev_drv_context_t *context)
{
    if (CY_USBFS_DEV_DRV_EP_MANAGEMENT_CPU != context->mode)
    {
        uint32_t autoMemMask = 0U;

        if (CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO == context->mode)
        {
            autoMemMask = USBFS_USBDEV_ARB_CFG_AUTO_MEM_Msk;

            /* Configure DMA burst size */
            USBFS_DEV_DMA_THRES16(base) = DMA_YLOOP_INCREMENT;
            USBFS_DEV_BUF_SIZE(base)    = ENDPOINTS_BUFFER_SIZE;

            /* USBFS_DEV_EP_ACTIVE and USBFS_DEV_EP_TYPE are set when endpoint is added */
        }

        /* The configuration completes: Generates a rising edge for the USBDEV_ARB_CFG.CFG_CMP bit */
        USBFS_DEV_ARB_CFG(base)  = _VAL2FLD(USBFS_USBDEV_ARB_CFG_DMA_CFG, context->mode) |
                                   autoMemMask;
        /* Read the register to ensure that the write is flushed out to the hardware */
        (void) USBFS_DEV_ARB_CFG(base);
        USBFS_DEV_ARB_CFG(base) |= USBFS_USBDEV_ARB_CFG_CFG_CMP_Msk;
        (void) USBFS_DEV_ARB_CFG(base);
    }
}


