RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_usbfs_dev_drv_io.c
/*******************************************************************************
* Function Name: Cy_USBFS_Dev_Drv_UnConfigureDevice
****************************************************************************//**
*
* Clears device configuration.
* Call this function before setting a configuration or a configuration failure
* to set the configuration into the default state.
* Alternately, call \ref Cy_USBFS_Dev_Drv_RemoveEndpoint for each active endpoint.
*
* \param base
* The pointer to the USBFS instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
*******************************************************************************/
void Cy_USBFS_Dev_Drv_UnConfigureDevice(USBFS_Type *base, cy_stc_usbfs_dev_drv_context_t *context)
{
    uint32_t endpoint;

    /* Clears the buffer pointer */
    context->curBufAddr = 0U;

    /* Removes all active endpoints */
    context->activeEpMask = 0U;

    /* Disables the SIE and Arbiter interrupts */
    USBFS_DEV_SIE_EP_INT_EN(base) = 0UL;
    USBFS_DEV_ARB_INT_EN(base)    = 0UL;

    /* Clear endpoints configuration */
    for (endpoint = 0U; endpoint <  CY_USBFS_DEV_DRV_NUM_EPS_MAX; ++endpoint)
    {
        /* Disable endpoint operation */
        DisableEndpoint(base, endpoint, context);
    }
}


/*******************************************************************************
* Function Name: GetEndpointBuffer
****************************************************************************//**
*
* Returns a start position in the allocated buffer for the data endpoint.
*
* \param size
* The data endpoint buffer size.
*
* \param idx
* The start position of the allocated endpoint buffer.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return
* The status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t GetEndpointBuffer(uint32_t size, uint32_t *idx, cy_stc_usbfs_dev_drv_context_t *context)
{
    cy_en_usbfs_dev_drv_status_t retStatus = CY_USBFS_DEV_DRV_BUF_ALLOC_FAILED;
    uint32_t bufSize;
    uint32_t nextBufAddr;

    /* Get max buffer size */
    bufSize = (CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA_AUTO != context->mode) ?
                CY_USBFS_DEV_DRV_HW_BUFFER_SIZE :
                context->epSharedBufSize;

    /* Gets a next buffer address. Note: the end buffer size must be even for the 16-bit access. */
    nextBufAddr  = (context->curBufAddr + size);
    nextBufAddr += (context->useReg16) ? (size & 0x01U) : 0U;

    /* Checks whether there is enough space in the buffer. */
    if (nextBufAddr <= bufSize)
    {
        /* Updates the pointers */
        *idx = context->curBufAddr;
        context->curBufAddr = (uint16_t) nextBufAddr;

        retStatus = CY_USBFS_DEV_DRV_SUCCESS;
    }

    return retStatus;
}


/*******************************************************************************
* Function Name: RestoreEndpointHwBuffer
****************************************************************************//**
*
* Restores the endpoint active configuration for
* \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_CPU and
* \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA modes.
*
* \param base
* The pointer to the USBFS instance.
*
* \param mode
* Endpoints management mode.
*
* \param endpointData
* The pointer to the endpoint data structure.
*
*******************************************************************************/
void RestoreEndpointHwBuffer(USBFS_Type *base,
                             cy_en_usbfs_dev_drv_ep_management_mode_t mode,
                             cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData)
{
    bool inDirection  = IS_EP_DIR_IN(endpointData->address);
    uint32_t endpoint = EPADDR2PHY(endpointData->address);

    /* Clears the  state: MEM_DATA is not non-retention */
    endpointData->state = CY_USB_DEV_EP_IDLE;

    /* Sets the Arbiter read and write pointers */
    Cy_USBFS_Dev_Drv_SetArbWriteAddr(base, endpoint, (uint32_t) endpointData->startBuf);
    Cy_USBFS_Dev_Drv_SetArbReadAddr (base, endpoint, (uint32_t) endpointData->startBuf);

    /* Enables the endpoint Arbiter interrupt sources */
    if (CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA == mode)
    {
        /* Enables the Arbiter interrupt sources for endpoint */
        Cy_USBFS_Dev_Drv_SetArbEpInterruptMask(base, endpoint, (inDirection ?
                                                                IN_ENDPOINT_ARB_INTR_SOURCES_DMA :
                                                                OUT_ENDPOINT_ARB_INTR_SOURCES_DMA));

        /* Enables the Arbiter interrupt for endpoint */
        Cy_USBFS_Dev_Drv_EnableArbEpInterrupt(base, endpoint);

        /* Enables the DMA channel */
         Cy_DMA_Channel_Enable(endpointData->base, endpointData->chNum);
    }
    else
    {
        /* Enables the error interrupt triggered by SIE */
        Cy_USBFS_Dev_Drv_SetArbEpInterruptMask(base, endpoint, ENDPOINT_ARB_INTR_SOURCES_CPU);
    }

    /* Enables the SIE interrupt for the endpoint */
    Cy_USBFS_Dev_Drv_EnableSieEpInterrupt(base, endpoint);

    /* Sets an arbiter configuration */
    Cy_USBFS_Dev_Drv_SetArbEpConfig(base, endpoint, (USBFS_USBDEV_ARB_EP1_CFG_CRC_BYPASS_Msk |
                                                     USBFS_USBDEV_ARB_EP1_CFG_RESET_PTR_Msk));

    /* Set endpoint mode to not respond to host */
    Cy_USBFS_Dev_Drv_SetSieEpMode(base, endpoint, GetEndpointInactiveMode((uint32_t) endpointData->sieMode));
}


/*******************************************************************************
* Function Name: AddEndpointHwBuffer
****************************************************************************//**
*
* Implements \ref Cy_USBFS_Dev_Drv_AddEndpoint for
* \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_CPU and
* \ref CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA modes.
*
* \param base
* The pointer to the USBFS instance.
*
* \param config
* The pointer to data endpoint configuration \ref cy_stc_usb_dev_ep_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return
* The status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t AddEndpointHwBuffer(USBFS_Type *base,
                                                 cy_stc_usb_dev_ep_config_t const *config,
                                                 cy_stc_usbfs_dev_drv_context_t   *context)
{
    uint32_t endpoint = EPADDR2PHY(config->endpointAddr);

    /* Gets a pointer to the endpoint data */
    cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData = &context->epPool[endpoint];

    /* Gets a buffer for the endpoint using the hardware buffer */
    if (config->allocBuffer)
    {
        uint32_t bufOffset;

        /* Gets a buffer for the endpoint */
        cy_en_usbfs_dev_drv_status_t retStatus = GetEndpointBuffer((uint32_t) config->bufferSize, &bufOffset, context);
        if (CY_USBFS_DEV_DRV_SUCCESS != retStatus)
        {
            return retStatus;
        }

        /* Sets the Arbiter read and write pointers */
        endpointData->startBuf = (uint16_t) bufOffset;
        Cy_USBFS_Dev_Drv_SetArbWriteAddr(base, endpoint, bufOffset);
        Cy_USBFS_Dev_Drv_SetArbReadAddr (base, endpoint, bufOffset);
    }

    /* Enables the endpoint for the operation */
    if (config->enableEndpoint)
    {
        bool inDirection = IS_EP_DIR_IN(config->endpointAddr);

