RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_usbfs_dev_drv_io.c
        /* Configures the endpoint */
        endpointData->state   = CY_USB_DEV_EP_IDLE;
        endpointData->address = config->endpointAddr;
        endpointData->toggle  = 0U;
        endpointData->bufferSize = config->maxPacketSize;
        endpointData->sieMode = GetEndpointActiveMode(inDirection, config->attributes);
        endpointData->isPending = false;

        /* Sets an arbiter configuration (clears DMA requests) */
        Cy_USBFS_Dev_Drv_SetArbEpConfig(base, endpoint, (USBFS_USBDEV_ARB_EP1_CFG_CRC_BYPASS_Msk |
                                                         USBFS_USBDEV_ARB_EP1_CFG_RESET_PTR_Msk));

        /* Flushes the IN endpoint buffer to discard the loaded data.
        * It happens when: an alternate settings change is requested and the IN
        * endpoint buffer is full (not read by the Host).
        */
        if (inDirection)
        {
            Cy_USBFS_Dev_Drv_FlushInBuffer(base, endpoint);
        }

        /* Enables the endpoint arbiter interrupt sources */
        if (CY_USBFS_DEV_DRV_EP_MANAGEMENT_DMA == context->mode)
        {
            /* Configures the DMA based on the endpoint direction */
            cy_en_usbfs_dev_drv_status_t retStatus = DmaEndpointInit(base, context->mode, context->useReg16, &context->epPool[endpoint]);
            if (CY_USBFS_DEV_DRV_SUCCESS != retStatus)
            {
                return retStatus;
            }

            /* Enables the arbiter interrupt sources for the endpoint */
            Cy_USBFS_Dev_Drv_SetArbEpInterruptMask(base, endpoint, (inDirection ?
                                                                    IN_ENDPOINT_ARB_INTR_SOURCES_DMA :
                                                                    OUT_ENDPOINT_ARB_INTR_SOURCES_DMA));

            /* Enables the arbiter interrupt for the endpoint */
            Cy_USBFS_Dev_Drv_EnableArbEpInterrupt(base, endpoint);
        }
        else
        {
            /* Enables the error interrupt triggered by SIE */
            Cy_USBFS_Dev_Drv_SetArbEpInterruptMask(base, endpoint, ENDPOINT_ARB_INTR_SOURCES_CPU);
        }

        /* Enables the SIE interrupt for the endpoint */
        Cy_USBFS_Dev_Drv_EnableSieEpInterrupt(base, endpoint);

        /* Sets endpoint mode to not respond to the host */
        Cy_USBFS_Dev_Drv_SetSieEpMode(base, endpoint, GetEndpointInactiveMode((uint32_t) endpointData->sieMode));
    }

    return CY_USBFS_DEV_DRV_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_USBFS_Dev_Drv_RemoveEndpoint
****************************************************************************//**
*
* Removes a data endpoint (release hardware resources allocated by data endpoint).
*
* \param base
* The pointer to the USBFS instance.
*
* \param endpointAddr
* The data endpoint address (7 bit - direction, 3-0 bits - endpoint number).
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
*******************************************************************************/
cy_en_usbfs_dev_drv_status_t Cy_USBFS_Dev_Drv_RemoveEndpoint(USBFS_Type *base,
                                                             uint32_t    endpointAddr,
                                                             cy_stc_usbfs_dev_drv_context_t *context)
{
    uint32_t endpoint = EPADDR2EP(endpointAddr);

    /* Checks if the endpoint is supported by the driver */
    if (false == IS_EP_VALID(endpoint))
    {
        return CY_USBFS_DEV_DRV_BAD_PARAM;
    }

    endpoint = EP2PHY(endpoint);

    /* Disable endpoint operation */
    DisableEndpoint(base, endpoint, context);

    /* Disable SIE and Arbiter interrupt for endpoint */
    Cy_USBFS_Dev_Drv_DisableSieEpInterrupt(base, endpoint);
    Cy_USBFS_Dev_Drv_DisableArbEpInterrupt(base, endpoint);

    /* Clear SIE and Arbiter interrupt for endpoint */
    Cy_USBFS_Dev_Drv_ClearSieEpInterrupt(base, endpoint);
    Cy_USBFS_Dev_Drv_ClearArbEpInterrupt(base, endpoint, ENDPOINT_ARB_INTR_SOURCES_ALL);

    /* Removes the active endpoint */
    context->activeEpMask &= (uint8_t) ~EP2MASK(endpont);

    /* Clear abort mask for endpoint */
    context->epAbortMask &= (uint8_t) ~EP2MASK(endpoint);

    return CY_USBFS_DEV_DRV_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_USBFS_Dev_Drv_EnableOutEndpoint
****************************************************************************//**
*
* Enables the OUT data endpoint to be read by the Host.
*
* \param base
* The pointer to the USBFS instance.
*
* \param endpoint
* The OUT data endpoint number.
*
* \param context
* The pointer to the context structure \ref cy_stc_usbfs_dev_drv_context_t
* allocated by the user. The structure is used during the USBFS Device
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usbfs_dev_drv_status_t.
*
* \note
* The OUT endpoints are not enabled by default. The endpoints must be enabled
* before calling \ref Cy_USBFS_Dev_Drv_ReadOutEndpoint to read data from an endpoint.
*
*******************************************************************************/
void Cy_USBFS_Dev_Drv_EnableOutEndpoint(USBFS_Type *base,
                                        uint32_t    endpoint,
                                        cy_stc_usbfs_dev_drv_context_t *context)
{
    CY_ASSERT_L1(IS_EP_VALID(endpoint));

    endpoint = EP2PHY(endpoint);
    CY_ASSERT_L1(IS_EP_DIR_OUT(context->epPool[endpoint].address));

    /* Get pointer to endpoint data */
    cy_stc_usbfs_dev_drv_endpoint_data_t *endpointData = &context->epPool[endpoint];

    /* Clear abort mask for the endpoint (there is no transfer during abort) */
    context->epAbortMask &= (uint8_t) ~EP2MASK(endpoint);

